## <span style="color:Brown"> **Lab5** </span> 
   
### <span style="color:bluegray"> pandas DataFrame </span>

In [6]:
import pandas as pd

 **1.	(1pt) Create a dataframe that looks like the following. Then use a separate statement to show names of all columns.** 
 
 <img src="df1.png" align="middle" style="width:200px;height:160px;"/>

**7.	(1 pt) Show the total number of passengers in the dataset.**

**7.	(1 pt) Show the total number of passengers in the dataset.**

In [10]:
d = {'name' : ['Alice', 'Tom', 'John', 'Kevin', 'Emma', 'Ethan'], 
     'instrument' : ['piano', 'guitar', 'Saxophone', 'drum', 'clarinet', 'electric guitar']}

In [11]:
df = pd.DataFrame(d)
df

    name       instrument
0  Alice            piano
1    Tom           guitar
2   John        Saxophone
3  Kevin             drum
4   Emma         clarinet
5  Ethan  electric guitar

 **2.	(1 pt) show names of all columns.**

In [13]:
df = pd.DataFrame(data=[['Alice', 'piano', ], 
     ['Tom', 'guitar']], 
                 columns = ['name', 'instrument'])
df

    name instrument
0  Alice      piano
1    Tom     guitar

In [14]:
df.index

RangeIndex(start=0, stop=2, step=1)

In [15]:
df.columns

Index(['name', 'instrument'], dtype='object')

**2.	(1 pt) Create another dataframe that looks like the following.** 

<img src="df2.png" align="middle" style="width:200px;height:160px;"/>

In [17]:
d = {'years' : [3, 5, 2, 4, 2, 3], 
     'instrument' : ['piano', 'guitar', 'Saxophone', 'drum', 'clarinet', 'electric guitar']}
df = pd.DataFrame(d, index=['Alice', 'Tom', 'John', 'Kevin', 'Emma', 'Ethan'])
df

       years       instrument
Alice      3            piano
Tom        5           guitar
John       2        Saxophone
Kevin      4             drum
Emma       2         clarinet
Ethan      3  electric guitar

**2.	(1 pt) Show names of all indices of the dataframe.**

In [19]:
df.index

Index(['Alice', 'Tom', 'John', 'Kevin', 'Emma', 'Ethan'], dtype='object')

**3.	(2 pts) Use pandas.Dataframe.loc and  pandas.Dataframe.iloc  respectively to show both Alice and Emmaâ€™s information.**

In [21]:
df.loc[['Alice','Emma'], :]
#or:
#df.loc[['Alice','Emma'], 'years':'instrument']

       years instrument
Alice      3      piano
Emma       2   clarinet

In [22]:
df.loc[['Alice', 'Emma']]

       years instrument
Alice      3      piano
Emma       2   clarinet

In [23]:
df.iloc[[0,4]]

       years instrument
Alice      3      piano
Emma       2   clarinet

**4.	(1 pt) Read *titanic.csv* into a dataframe called *titanicDF* and show the first five rows.**

In [25]:
titanicDF = pd.read_csv('titanic.csv', sep=',')
titanicDF.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

**5.	(1 pt) Show the total number of passengers in the dataset.**

In [27]:
titanicDF.shape[0]

891

**6.	(1 pt) Show the last 5 rows of *titanicDF*.**

In [29]:
titanicDF.iloc[-5:]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

**7.	(1 pt) Use *pandas.DataFrame.info()* to find out and show which columns have missing values. Show those columns' names in a separate markdown cell,using a color of your choice that's not black.**

In [31]:
titanicDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

<span style="color:blue"> Column "Age" and "Cabin" have missing information. <span>

**8. (1pt) Use *pandas.Dataframe.iloc* to show the *Survived, Pclass, Name, Sex and Age* of the first 10 rows of the dataframe.**

In [34]:
titanicDF.iloc[:10, 1:6]

,Survived,Pclass,Name,Sex,Age
0,0,3,"Braund, Mr. Owen Harris",male,22.0
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0
2,1,3,"Heikkinen, Miss. Laina",female,26.0
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0
4,0,3,"Allen, Mr. William Henry",male,35.0
5,0,3,"Moran, Mr. James",male,NaN
6,0,1,"McCarthy, Mr. Timothy J",male,54.0
7,0,3,"Palsson, Master. Gosta Leonard",male,2.0
8,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0
9,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0

**9. (1pt) Use *pandas.Dataframe.loc* to perform the same task as described in 7.**

In [36]:
titanicDF.loc[:9, ['Survived','Pclass','Name', 'Sex', 'Age'  ]]

,Survived,Pclass,Name,Sex,Age
0,0,3,"Braund, Mr. Owen Harris",male,22.0
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0
2,1,3,"Heikkinen, Miss. Laina",female,26.0
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0
4,0,3,"Allen, Mr. William Henry",male,35.0
5,0,3,"Moran, Mr. James",male,NaN
6,0,1,"McCarthy, Mr. Timothy J",male,54.0
7,0,3,"Palsson, Master. Gosta Leonard",male,2.0
8,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0
9,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0

**10.	(1 pt) Create a filter to find out the number of people who survived. Show the results.**

In [38]:
print(type(titanicDF['Survived'].iloc[0]))
filter_survived = titanicDF['Survived'] == 1
print("Number of people survivied: ", titanicDF[filter_survived].shape[0])

<class 'numpy.int64'>
Number of people survivied:  342

**11.	(1 pt) Use *pandas.Series.value_counts()* to do the same thing in 10.**

[https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.value_counts.html](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.value_counts.html)

In [40]:
print(type(titanicDF['Survived'].value_counts()))
print(titanicDF['Survived'].value_counts())
 
#https://pandas.pydata.org/docs/reference/api/pandas.Series.get.html
titanicDF['Survived'].value_counts().get(1,0)

#or: 
titanicDF['Survived'].value_counts("Survived")

<class 'pandas.core.series.Series'>
Survived
0    549
1    342
Name: count, dtype: int64

Survived
0    0.616162
1    0.383838
Name: proportion, dtype: float64

**12.	(1 pt) Create a filter to find out the number of survived females and males respectively and show the results.**

In [42]:
filter_survived = (titanicDF['Survived'] == 1) & (titanicDF['Sex'] == 'male')
print("Number of people survivied: ", titanicDF[filter_survived].shape[0])

Number of people survivied:  109

In [43]:
filter_survived = (titanicDF['Survived'] == 1) & (titanicDF['Sex'] == 'female')
print("Number of people survivied: ", titanicDF[filter_survived].shape[0])

Number of people survivied:  233

In [44]:
#titanicDF.apply(lambda x: x.value_counts().get(1,0), axis = 0) 
titanicDF.apply(lambda x: x.value_counts().get(1,0)) #by default, axis = 0

/var/folders/9m/brj5dz214t77hy00y15pwt380000gn/T/ipykernel_23054/3016760908.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  titanicDF.apply(lambda x: x.value_counts().get(1,0)) #by default, axis = 0
/var/folders/9m/brj5dz214t77hy00y15pwt380000gn/T/ipykernel_23054/3016760908.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  titanicDF.apply(lambda x: x.value_counts().get(1,0)) #by default, axis = 0
/var/folders/9m/brj5dz214t77hy00y15pwt380000gn/T/ipykernel_23054/3016760908.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  titanicDF.apply(lambda x: x.value_counts().get(1,0)) #by default, axis = 0
/var/folders/9m/brj5dz214t77hy00y15pwt380000gn/T/ipykernel_23054/3016760908.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  titanicDF.apply(lambda x: x.value_counts().get(1,0)) #by default, axis = 0
/var/folders/9m/brj5dz214t77hy00y15pwt380000gn/T/ipykernel_23054/3016760908.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  titanicDF.apply(lambda x: x.value_counts().get(1,0)) #by default, axis = 0

PassengerId      1
Survived       342
Pclass         216
Name             1
Sex            314
Age              7
SibSp          209
Parch          118
Ticket           7
Fare             0
Cabin            4
Embarked       168
dtype: int64

**13.	(1 pt) Create a filter to find out the number of passengers younger than 18 or older than 60. Show the results.**

In [46]:
filter_children_senior = (titanicDF['Age'] < 18) | (titanicDF['Age'] > 60)
print("Number of children and seniors ", titanicDF[filter_children_senior].shape[0])

Number of children and seniors  135

In [47]:
filter_children_senior = (titanicDF['Age'] >= 18) & (titanicDF['Age'] <= 60)
print("Number of children and seniors ", titanicDF[~filter_children_senior].shape[0])

Number of children and seniors  312

**14.	(1 pt) Pandas tools can help us address some research questions. Use groupby() to address the following research question: <br> 
"What is the average ticket fare for passengers who survived compared to those who did not?"**

In [49]:
titanicDF.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [50]:
groupedBySurvived_DF = titanicDF[['Survived','Fare']].groupby('Survived').mean()
# or: groupedBySurvived_DF = titanicDF.groupby('Survived')['Fare'].mean(), 
# or: groupedBySurvived_DF = titanicDF['Survived'].value_counts()
groupedBySurvived_DF

               Fare
Survived
0         22.117887
1         48.395408

In [51]:
groupedBySurvived_DF = titanicDF[['Survived','Age']].groupby('Survived').mean()
groupedBySurvived_DF

                Age
Survived
0         30.626179
1         28.343690

In [52]:
titanicDF[['Survived','Pclass', 'PassengerId']].groupby(['Survived','Pclass']).count()

                 PassengerId
Survived Pclass
0        1                80
         2                97
         3               372
1        1               136
         2                87
         3               119

**15.	(1 pt) Create another research question and address it using the groupby() function.**